[
  {
    "path": "posts/2021-03-21-dataviz-makeover-3/",
    "title": "DataViz Makeover 3",
    "description": "Dive deeper into the spatio-temporal patterns of armed conflict in selected South-east Asia countries between 2010 - 2020.",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": {}
      }
    ],
    "date": "2021-03-19",
    "categories": [
      "DataViz Makeover"
    ],
    "contents": "\n\nContents\n1. Background Information\n2. Critiques and Suggestions\n2.1 Clarity\n2.2 Aesthetics\n2.3 Interactivity\n\n3. Proposed Design\n3.1 Sketch\n3.2 Advantages of Proposed Design\n\n4. Data Visualisation Step-by-Step\n4.1 Data Preparation\n4.2 Creating Visualisation\n4.2.1 Spatial Analysis Dashboard\n4.2.2 Temporal Analysis Dashboard\n4.2.3 Main Dashboard\n\n5. Major Observations\n\nData Visualisation Link (Tableau Public) - https://public.tableau.com/profile/xinyue.bai#!/vizhome/dataviz_16162565365570/South-eastAsiaArmedConflictAnalysis?publish=yes\n1. Background Information\nFor this visualisation makeover, I have used data from ACLED. ACLED focuses on tracking a range of violent and non-violent actions by political agents, including governments, rebels, militias, identity groups, political parties, external actors, rioters, protesters and civilians. Data collected is used regularly to study trends in political violence and protest around the world. In particular, this post is interested in exploring the spatio-temporal patterns of armed conflict in selected South-east Asia countries, including Cambodia, Indonesia, Laos, Malaysia, Myanmar, Philippines, Thailand and Vietnam, between 2015 and 2020.\nIn this blog, I will makeover visualisation on South-east Asia Armed Conflict provided by Prof.Kam, by looking into the following questions:\nWhere did the event take place?\nWhen did the event take place?\nWho was involved?\nWhat was the number of fatalities of the event?\n2. Critiques and Suggestions\n\n\n\nFigure 1: original visualisation\n\n\n\n2.1 Clarity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n1\n\n\nY-axis of the line chart does not start at 0, making it hard to compare between event types.\n\n\nMake y-axis start at 0 and make it consistent across all event types.\n\n\n2\n\n\nAlso, the name of y-axis “Count of Sheet1” is unclear.\n\n\nLabel the y-axis as “Count of Event Type”.\n\n\n3\n\n\nIt’s redundant and hard to compare having 6 separate line graphs.\n\n\nCombine 6 graphs into 1 graph and use different colours to represent event types.\n\n\n2.2 Aesthetics\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n4\n\n\nPoints on the map are overlapping. It’s hard to distinguish the event type at each area.\n\n\nApart from a map of events’ exact location, we can have another map to summarise information of events:\nDisplay events in a state/province level instead of precise location.\nUse unclassified choropleth map to demonstrate the event density in each state/province.\nUse pie chart to show the distribution of event type in the tooltip.\n\n\n5\n\n\nOrder of the event type on the line chart is not aligned with the colour legend.\n\n\nMake order of the line chart align with the colour legend.\nMatch the line colour with the colour legend.\n\n\n2.3 Interactivity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n6\n\n\nInteraction techniques used in this visualisation are highlighting(event type) and filtering(country), allowing audiences to see the exact location of all events between 2010 - 2015 and the total counts of each event type over the years for every South-East Asia country. However, the interactivity is very limited. For example, what if audiences want to know the location of events in a specific year, as it might be different every year?\n\n\nWe can add more filtering options, such as year, range of dates and event type.\n\n\n7\n\n\nSince only two techniques are used in this case, there are other type of interactivity can be applied to get a more comprehensive understanding of the data.\n\n\nFor example, “Overview first, then details-on-demand” from Shneiderman’s mantra, we can provide a map with an overview of the event frequency with respect to state/region and a pie chart for each state on detailed distribution of event type in the tooltip. Similarly, for each event location, we can include names of two conflict groups (Actor 1 & Actor 2) in the tooltip.\n\n\n3. Proposed Design\n3.1 Sketch\nFigure 2: sketch of proposed design3.2 Advantages of Proposed Design\nProposed design allows more filtering options (e.g. year, range of event date, event type).\nProposed line graph is more succinct and easier to compare between event types (6 lines in one plot). Also, adding information of fatalities offers audiences a better understanding of the severity of events.\nProposed state-level density map offers a more comprehensive view of the data, by showing frequency and distribution of events.\nProposed heatmap of event frequency between different groups allows audiences to know which two parties are frequently involved in an armed conflict. This information is very useful in preventing or mitigating future conflicts.\n4. Data Visualisation Step-by-Step\n4.1 Data Preparation\nImport Southeast-Asia_2010-2020_Oct31.xlsx file into tableau.\nChange the data type of Year to Date. \nSelect data between 2015 and 2020, by clicking Filters - Add from the top right-hand corner.\n\n\n\n\nChange the data type of Admin1 to Geographic Role -> State/Province.\nSimilarly, change the data type of Interaction to String.\n4.2 Creating Visualisation\n4.2.1 Spatial Analysis Dashboard\nOpen a new worksheet (to create an event density map).\nDouble click on Admin1 and drag Country to Detail. \nChange graph representation from Automatic to Map under Marks. \nDrag Event Type to Color and apply Measure -> count, to get total count of events for each state.\nDrag Country, Event Type, Event Date, Year to Filters and click Show Filter.\n\n\nChange the color palatte to Red. \nChange the style of map from Light to Normal (Map -> Map Layer -> Style -> Normal).\n\n\nOpen another new worksheet (to create a pie chart of event distribution).\nDrag Admin1, Country to Detail, Event Type to Color, and change graph representation from Automatic to Pie under Marks.\nDrag Event Type to Angle, applying Measure -> count (shown in step 4), Quick Table Calculation -> Percent of Total and Compute Using -> Event Type.\n\n\nSimilarly, drag Event Type to Label and apply the same procedure as in step 10. Final look of the pie chart:\nInclude the pie chart in the Tooltip of state-level event density map.\n\n\nOpen another new worksheet (to create a map of event exact location).\nDrag Longitude and Latitude to Columns and Rows respectively, and change both variables from Measure(Average) to Dimension.\nChange graph representation from Automatic to Shape under Marks and drag Event Type to Color and Shape, adjust the size. \nDrag Actor1, Actor2, Interaction to Detail and change Interaction from Measure(Count) to Dimension (as shown in step 14), allowing audiences to know which party is involved in each conflict, by hovering over the points.\nChange the style of map from Light to Normal (as shown in step 7).\nOpen a new dashboard.\nChange the size of dashboard to Generic Desktop. \nDrag 2 maps into dashboard and change representation of all filters excpet Event Date to Single Value (Dropdown).\nApply all filters on 2 maps, by adjusting Applying to Worksheets -> Selected Worksheets.\n\n\nEdit title of 2 maps. \nEdit unknown locations, by googling online.\n\n\nFinal look of Spatial Analysis Dashboard. \n4.2.2 Temporal Analysis Dashboard\nOpen a new worksheet (to create a line graph showing frequency of each event type over years).\nDrag Year and Event Type to Columns and Rows respectively, and change Event Type from Dimension to Measure(Count) (as shown in 4.2.1. step 14).\nDrag Event Type to Color.\nDrag Country, Event Date, Event Type to Filters and click Show Filter. Final look:\nOpen another new worksheet (to create a line graph showing count of fatalities by event type over years).\nDrag Year and Fatalities to Columns and Rows respectively and drag Event Type to Color. Final look:\nOpen another new worksheet (to create a heat map showing frequency of conflicts between two parties over years).\nDrag Year and Interaction to Columns and Rows respectively, and change Interaction from Measure(Count) to Dimension (as shown in 4.2.1. step 14).\nDrag Event Type to Color and change it from Dimension to Measure(Count) (as shown in 4.2.1. step 14).\nChange the color palatte to Red (as shown in 4.2.1. step 6). Final look:\nOpen a new dashboard.\nChange the size of dashboard to Generic Desktop (as shown in 4.2.1. step 19).\nDrag 1 heatmap and 2 line graphs into dashboard.\nChange representation of Event Type filter to Single Value (Dropdown) and representation of Country filter to Single Value (List) (as shown in 4.2.1. step 20).\nApply all filters on 3 graphs, by adjusting Applying to Worksheets -> Selected Worksheets (as shown in 4.2.1. step 21).\nEdit title of 3 graphs (as shown in 4.2.1. step 22).\nAdd a Text Object to dashboard, explaining the meaning of interaction code.\nFinal look of Temporal Analysis Dashboard. \n4.2.3 Main Dashboard\nDownload images of earth and calendar online, create a custom folder under My Tableau Repository -> Shapes and put images inside.\nCreate a calculated field named image, with value 0. \nOpen a new worksheet (to create a Button for Spatial Analysis Dashboard).\nDrag image to Detail and change graph representation from Automatic to Shape under Marks (as shown in 4.2.1. step 3).\nChange the default shape to the image of earth.\n\n\n\nChange the layout of the worksheet from Standard to Entire View.\nEdit the content of Tooltip to “click to view the spatial analysis” \nSimilarly, open a new worksheet (to create a Button for Temporal Analysis Dashboard) and a new worksheet (to create a Button for Return to the Main Dashboard).\nOpen a new dashboard and change the size of dashboard to Generic Desktop (as shown in 4.2.1. step 19).\nDrag 2 image worksheets into dashboard and add border. \nAdd a Text Object to dashboard (as shown in 4.2.2. step 17), giving a brief introduction of this data visualization.\nAdd an Image Object to dashboard.\n\n\nAdd 2 Text Object to dashboard as titles of spatial and temporal analysis dashboards, and change their background color.\nAdd interactivity on the Earth and Calendar worksheets.\n\n\n\n\n\nFinal look of Main Dashboard: \nSimilarly, add interactive Return Button on Spatial Analysis Dashboard and Temporal Analysis Dashboard.\n\n\n5. Major Observations\nAs we can see from the event density map, Shan province in Myanmar has the highest number of political conflicts between 2015-2020 and 63% of events in Shan are battles. By jumping to the Temporal Analysis Dashboard and select Shan, battles occurred most frequently in 2015, between state forces and rebel groups, resulting in more than 800 fatalities.\n\n\n\n\nAs we can see from the temporal heat map, the number of protests (1-sided protest) has been increasing over the years. By looking into spatial dashboard, the majority of protests took place in Jakarta.\n\n\nAlthough the number of protests is relatively high compared to other type of events, fatalities of protests are generally low. Violence against civilians occurred frequently between 2015 - 2020 and its fatalities are also high, peaking at 3569 in 2016. \nArmed conflict between rebel groups and protestors, political militias and identity militias, identity militias and rioters, identity militias and external forces, protestors and civilians are very rare. \n\n\n\n",
    "preview": "posts/2021-03-21-dataviz-makeover-3/Critique.png",
    "last_modified": "2021-03-21T23:53:12+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-28-group-project-proposal-data-visualization-survey-analysis/",
    "title": "Group project proposal: data visualization survey analysis",
    "description": {},
    "author": [
      {
        "name": "Bai Xinyue, Li Hongtng, Zhang Weimin",
        "url": {}
      }
    ],
    "date": "2021-02-28",
    "categories": [],
    "contents": "\n1. Introduction and Motivation\nData visualization is the graphical representation of information and data. It has been an important factor in data analytics pipeline, to reveal insights that are often difficult to be delivered in other forms. It is commonly used in various scenarios, such as data cleaning, exploring data structure, detecting pattern, identifying trends and clusters. It helps operations and management make informative decisions. Understanding the current state of data visualization is crucial. It gives organizations and practitioners in the field a better idea of where data visualization stands today, and where it’s headed.\nCollected and organized by Data Visualization Society, Annual Data visualization Community Survey includes 50+ data visualization related questions and covers data visualization details such as salary, tool use, demographic data, audiences and organizational structure. By analyzing the survey results, it can help organizations know who the data visualization professionals are and how they work. On the other hand, it helps people who have an interest in data visualization know how to enter the field.\n2.Objectives\nIn this research study, we will build a R Shiny application to illustrate the current state of data visualization. The goal is to draw a comprehensive picture of data visualization for organizations, practitioners and people having an interest in data visualization, by analyzing Annual Data visualization Community Survey.\nThe analysis and visualization consist of three parts: exploratory data analysis, respondents clustering and association analysis.\nThe exploratory data analysis aims to summarize the main characteristics of the measures and generate statistical graphics to visualize them.\nThe clustering aims to perform clustering analysis to discover similarities in respondents.\nTo provide DataViz practitioners a guidance what are the commonly used combination of tools.\n3. About the Data\nThe Annual Data Visualization Community Survey 2019 will be used for this project. This dataset includes responses from 1350 people. We classify the dataset into 5 different categories, challenges people face, demographics data, job-related, learning-related and tool-related questions. Below is a snippet of our dataset. Data source can be found from: https://github.com/data-visualization-society/data_visualization_survey.\n\n\n\nFigure 1: Survey content and category\n\n\n\n4. Methodology, approach and visualization\n4.1 EDA\nIn statistics, exploratory data analysis is an approach to analyzing data sets to summarize their main characteristics. We are going to use statistical graphics to visualize the results of EDA.\nBroadly, the questions will be categorized by field of topic. Five fields of topic could be recognized/ identified – Job, learning, demography and tool and challenge.\nFor the demography part, gender, education background, major and country lived of the data visualization professionals will be checked for distribution. Bar charts will be used here.\n\n\n\nFigure 2: Bar chart\n\n\n\nFor the learning part, the proportion of each learning methods can be detected. Pie charts will be used here.\n\n\n\nFigure 3: Donut chart\n\n\n\nFor the Job part, we can compare the proportion of each stage of data visualisation take part in a professional data visualization work. We can also check how many organizations have a data visualization team, how many data visualization professionals are hired to do data visualization only and what are the business areas data visualization supports. Pie charts will be used here.\nFor the tool part, the proportion of the technologies used to visualize data and the method used to present data visualization could be observed. Scatter plots with error bars will be used here to display the popularity of each kind of data visualisation technology and data visualization presentation methods. We can also break down the analysis using variables from the three fields above using a variable selection parameter and focus on measure value we are look at only.\n\n\n\nFigure 4: Dot chart with error bar\n\n\n\nFor the challenge part, the willingness of the data visualization professionals to keep improving their data visualisation skills and the area of priority to improve their data visualization skills could be investigated. Proportion of the levels of willingness and the areas for improvement could be examined. Scatter plots with error bars will be used here to present the probability of each level of willingness and area for improvement and projected the sample probability to the population one with a confidence interval. We can also break down the analysis using variables from the three fields above using a variable selection parameter and focus on measure value we are look at only.\n4.2 Respondents clustering:\nFor this dataset, we aim to perform clustering analysis to discover similarities in respondents. We classify the respondents based on their roles in the company, usage of visualization tools and purpose of making data visualization. We will use unsupervised clustering algorithm, latent class analysis (LCA), to show the relationship between respondents. LCA offers a way to uncover hidden groupings (latent classes) in multivariate categorical data, by applying maximum likelihood method to calculate the probability that a case will fall in a particular latent class.\n\n\n\nFigure 5: Latent class analysis example\n\n\n\nAlternatively, we can use dendrogram to show the hierarchical relationship between objects. Dendrogram starts with each object as a separate cluster, and joins the two most similar clusters to form a single compound cluster at each step. By examining the heights of the dendrogram, the similarity between the clusters and the order in which the clusters are joined can be derived.\n\n\n\nFigure 6: Dendrogram example\n\n\n\n4.3 Association rule mining\nAssociation Rule Mining is unsupervised machine learning method used to find an association between different objects in a set, and frequent patterns in a database. We will apply this technique to analyze association, e.g. data visualization software being used by professionals together. This allows data visualization professionals to consider associative tools and service providers to cross-selling associative products.\nCommonly used terminology in association include itemset, support, confidence, lift. Here, I will illustrate with below small size example.\n\n\n\nFigure 7: Sample data to explain association rule mining\n\n\n\nBelow is the definition of 3 key terminologies and illustration of calculation using above sample.\n\n\n\nFigure 8: Association rule mining terminology\n\n\n\nAPRIORI algorithm is used for association rule mining. It starts with frequent itemset generation and find all frequent item-sets satisfy pre-determined min-support count threshold. List all association rules from frequent item-sets. Calculate support and confidence for all rules and keep rules that satisfy min_support and min_confidence count. For each rule, we can use lift to examine the correlation of itemset A and itemset B.\nIn this part, we aim to present the confidence vs support situation for all rules like figure 1, and also allow users to select a specific rule or rules and present the details of rules.\n\n\n\nFigure 9: Confidence vs support for all rules\n\n\n\n\n\n\nFigure 10: Display rules with itemset\n\n\n\n5. Proposed R packages:\n\n\n\nFigure 11: Proposed R packages\n\n\n\n6. Project timeline\n\n\n\nFigure 12: Project Gantt chart\n\n\n\n\n\n\n",
    "preview": "posts/2021-02-28-group-project-proposal-data-visualization-survey-analysis/1.png",
    "last_modified": "2021-03-21T11:38:34+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-02-19-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Dive deeper into survey results of public's willingness on Covid-19 vaccination.",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [
      "DataViz Makeover"
    ],
    "contents": "\n\nContents\n1. Background Information\n2. Critiques and Suggestions\n2.1 Clarity\n2.2 Aesthetics\n\n3. Proposed Design\n3.1 Sketch\n3.2 Advantages of Proposed Design\n\n4. Data Visualisation Step-by-Step\n4.1 Data Preparation\n4.2 Creating Visualisation\n4.2.1 Visualisation 1\n4.2.2 Visualisation 2\n4.2.3 Visualisation 3\n4.2.4 Visualisation 4\n4.2.5 Visualisation 5\n4.2.6 Visualisation 6\n4.2.7 Visualisation 7\nAdd Tooltip on Visualisation 1 & 2\n4.3 Creating Dashboard\n\n5. Major Observations\n\nData Visualisation Link (Tableau Public) - https://public.tableau.com/profile/xinyue.bai#!/vizhome/ofStronglyAgree-gettingCOVID/DatavizMakeover2?publish=yes\n1. Background Information\nFor this visualisation makeover, I have used data from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub. This data gathers global insights on people’s behaviours in response to COVID-19 covering 29 countries, in the form of survey questionnaire. In particular, this post is interested in exploring the willingness of the public on COVID-vaccination. In this blog, I will makeover visualisation on vaccine willingness done by one of the research scientists, by examining the following 3 survey questions in the context of different gender and employment status:\n1. If a Covid-19 vaccine were made available to me this week, I would definitely get it.\n2. I am worried about getting COVID19.\n3. I am worried about potential side effects of a COVID19 vaccine.\n2. Critiques and Suggestions\n\n\n\nFigure 1: original visualisation\n\n\n\n2.1 Clarity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n1\n\n\nVisualisation on the left is intended to show “which country is more pro-vaccine”, by computing the percentage of each response and combining them into a percentage stacked bar chart. However, for each country, it’s not easy to see the proportion of pro-vaccine and compare it among different countries.\n\n\nSort countries by proportion of pro-vaccine responses in descending order.\n\n\n2\n\n\nMoreover, scaling each bar into the same height is not clear enough to compare the difference between pro-vaccine responses and anti-vaccine responses.\n\n\nPlace neutral responses at centre 0, negative value showing proportion of disagree responses and positive value showing proportion of agree responses.\n\n\n3\n\n\nIt’s hard to distinguish bars having the same length.\n\n\nAdd value label on each bar.\n\n\n4\n\n\nLegend is not very clear, i.e. what does 2, 3, 4 represent specifically?\n\n\nChange 2, 3, 4 to 2 – Agree, 3 – I don’t know, 4 – Disagree respectively.\n\n\n5\n\n\nVisualisation on the right is generally straightforward and clear. However, the simple percentage does not reflect statistical measures, how much you can expect your service results to reflect the view from the overall population. For example, if we have a high proportion of strongly agree responses with a wide margin of error, then this survey result is not very reliable.\n\n\nCalculate confidence interval for each value to get a more comprehensive view of the survey results.\n\n\n6\n\n\nMoreover, this visualisation is not convincing enough in a way that only high level view of the survey results is presented and insights from different angles are not revealed. For example, by examining deeper into gender level, males are generally more willing to get vaccinated than females respondents.\n\n\nExplore survey results from various perspectives, such as gender and employment status, and the relation between other survey questions.\n\n\n2.2 Aesthetics\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n1\n\n\nIt’s redundant and distractive to use five different colours for each response in the left visualisation, making it hard to view the survey results. | Use the same colour for the same group (1.agree 2.neutral 3. disagree) with different hue level. For example, dark green for strongly agree, light green for agree.\n\n\nUse the same colour for the same group (1.agree 2.neutral 3. disagree) with different hue level. For example, dark green for strongly agree, light green for agree.\n\n\n2\n\n\nThe x-axis of two visualisations are not consistent, the first plot has no decimal place whereas the second plot has 2 decimal places.\n\n\nMake them consistent.\n\n\n3\n\n\nGenerally good axis marks in twenties and grid lines to facilitate easy readings, clear use of fonts, font sizes and layout with very straightforward titles.\n\n\nFollow and format to ensure so.\n\n\n3. Proposed Design\n3.1 Sketch\nFigure 2: sketch of proposed design3.2 Advantages of Proposed Design\nThe first visualisation:\n1. Clearly show which country is more pro-vaccine, by sorting rows according to % of pro-vaccine.\n2. Easier to detect difference between two types of responses and difference between countries, with postive and negative x-axis representing pro-vaccine and anti-vaccine responses respectively.\nThe second visualisation:\n- Clearly show how reliable the result is, by applying confidence interval.\nThe third visualisation:\n- Help audiences better understand the public willingness on Covid-19 vaccination and the potential reasons why the public agrees or disagrees to getting vaccinated, by looking into the result of survey’s questions vac2.1(worry about getting COVID) and vac2.2(worry about potential side effect of vaccine), and plotting their relation wtih trend lines.\nOther comments:\n- By applying tooltip, the fourth and fifth visualisation provide audiences with a more comprehensive understanding of the survey results on vaccine willingness at the country level. Similarly, being able to filter via gender and employment status gives insights on the different behaviours within each group.\n4. Data Visualisation Step-by-Step\n4.1 Data Preparation\nImport australia.csv, canada.csv, denmark.csv, finland.csv, france.csv, germany.csv, italy.csv, japan.csv, netherlands.csv, norway.csv, singapore.csv, south-korea.csv, sweden.csv, united-kingdom.csv files into tableau.  \nDouble click on New Union at the bottom left of Files and drag all csv files into Specific. \nClick on the triangle button on the top right and custom split variable vac_1 to obtain the score value for each response category (e.g. 1 - Strongly agree -> 1). \nEdit aliases for new column created (i.e. vac_1 - Split 1), 1 -> 1 - Strongly, 2 -> 2 - Agree, 3 -> 3 - I don’t know, 4 -> 4 - Disagree, 5 -> 5 - Strongly disagree. \nRename new column as vac1_score.\nClick on “=Abc” symbol and change its data type to Number(whole). \nRename Table Name as Country.\n4.2 Creating Visualisation\n4.2.1 Visualisation 1\nOpen a new worksheet.\nClick on Analysis -> Create Calculated Field.\nCreate 7 calculated fields as follow:\nNumber of Records - Vac1\nTotal Records - Vac1\nCount Negative\nTotal Count Negative\nPercentage - Vac1\nGantt Start\nGantt Percentage\n\nDrag Country to Rows, Grantt Percentage to Columns, vac1_score to Detail and Color\nGantt Percentage, click on the triangle button -> Compute Using -> vac1_score\nOn the legend panel, right click on Null, exclude null records.\nOn the Marks panel, right click on the triangle button of vac1_score (either color or detail), manually sort the vac1_score, in a order of strongly disagree -> disagree -> I don’t know -> agree -> strongly agree.\n\n\nBefore sort: \nAfter sort: \nChange chart type from Automatic to Gantt Bar\nDrag Percentage - Vac1 to Size and Label.\nAdjust label’s alignment.\nChange label’s format from Automatic to Percentage.\n\n\nSimilarly, right click on the x-axis and choose format, change axis’s value format to Percentage and add tick marks.\n\nAdd tick marks: \nChange color of the gantt bar. What it displays here is already the color I wanted. Red color represents anti-vaccine responses and green color represents pro-vaccine responses. Also, darker color implies more extreme responses (e.g. strongly agree and strongly disagree).\nSort Country by % of pro-vaccine responses.\nRight click on x-axis Edit Axis, change x-axis’s range to -100% to 100% and change its title to % of Total.\n\n\nDrag gender and employment_status to Filters.\n\n\nAdd pro-vaccine and anti-vaccine annotation on the chart for better clarity.\nRight click on the pane and create an annotation box for pro-vaccine.\nRight click on the box and select format to change the background color.  \nApply the same procedure for anti-vaccine annotation. Final look:   \n4.2.2 Visualisation 2\nOpen a new worksheet.\nCreate 11 calculated fields as follow:Number of Strongly Agree - Vac1\nProp of strongly agree - vac1\nZ_95%\nZ_99%\nProp-Standard Error\nProp_Margin of Error 95%\nProp_Margin of Error 99%\nProp_Confidence Interval 95%\nProp_Confidence Interval 99%\n\nDrag Country to Rows and Prop of strongly agree - vac1 to Columns\nDrag Measure Values to the top of x-axis.   \nIn the Filters panel, click on Measure Names -> Edit Filter -> select 95% and 99% upper and lower limits.\n\n\nChange 95% and 99% confidence interval representation to Line, click on the path and choose the last Line Type.\n\n\nDrag Measure Names to path under Measure Values section.\nClick on Measure Names (Detail) under Measure Values section and Prop of strongly agree - vac1 section, change it to Color.\n\nChange columns order, put Measure Values before Prop of strongly agree - vac1 and right click on the top x-axis -> synchronize axis.  \n\n\nChange the Measure Names’ order in the color legend, by adjusting in the Measure Values section.\n\n\nHide the top x-axis, by unticking Show Header.\nSort rows according to % of strongly agree.\nChange the color for 95% and 99% confidence interval according to your own preference, change axis’s number format and add tick marks. Detailed procedures are described in the visualisation 1.\n4.2.3 Visualisation 3\nOpen a new worksheet.\nCreate 8 calculated fields as follow:\nDetailed formulation can refer to visualisation 1, using Vac2.1 and Vac2.2 instead:\nNumber of Records - Vac2.1, Number of Records - Vac2.2\nTotal Records - Vac2.1, Total Records - Vac2.2\n\nDetailed formulation can refer to visualisation 2, using Vac2.1 and Vac2.2 instead.\nNumber of Strongly agree - Vac2.1, Number of Strongly agree - Vac2.2\nProp of strongly agree - vac2.1, Prop of strongly agree - vac2.2\n\nDrag Prop of strongly agree - vac1 to Columns, Prop of strongly agree - vac2.1 and Prop of strongly agree - vac2.2 to Rows, also drag Country to Detail under All section.\nDrag Measure Names to Filters and only tick Prop of strongly agree - vac2.1 and Prop of strongly agree - vac2.2.\nDrag Measure Names to Color under All section.\nRight click on the pane to add two trendlines.\nDrag Country to Label and highlist points wiht minimum % of strongly agree 2.1/2.2 and maximum % of strongly agree 2.1/2.2.\n\nChange axis’s number format and add tick marks. Detailed procedures are described in the visualisation 1.\n4.2.4 Visualisation 4\nOpen a new worksheet.\nDrag Country to Rows and Prop of strongly agree - vac2.1 to Columns, drag another Prop of strongly agree - vac2.1 to the top of x-axis and synchronize axis.\nChange one of the variable representation to Bar.\nAdjust size and color of Bar and Circle.\nDrag Country to Label under Prop of strongly agree - vac2.1 (Circle) section and click on Label to just its Alignment.\nChange the label format to Percentage.\n\nSort rows according to % of strongly agree - vac2.1, change axis’s number format and range, add tick marks. Detailed procedures are described in the visualisation 1.\nFinal look of visualisation 4.   \n4.2.5 Visualisation 5\nSame procedure as visualisation 4, except using Prop of strongly agree - vac2.2 instead of Prop of strongly agree - vac2.1.\n4.2.6 Visualisation 6\nOpen a new worksheet.\nDrag employment_status to Columns, and two vac1_score to Rows, modify both of them to measure Count.\nRight click on the bottom y axis to make the plot into dual axis.\nExclude Null employment status.\nChange one of the vac1_score representation to Line.\nDrag vac1_score to Label under the circle representation and modify it into count.\nApply Quick Table Calculation - Percent of Total to all three CNT(vac1_score).\nKeep only one y-axis, change the name of y-axis. Detailed procedures are described in the previous visualisation.\nFinal look of visualisation 6.\n4.2.7 Visualisation 7\nSame procedure as visualisation 4, except using gender instead of employment_status.\nAdd Tooltip on Visualisation 1 & 2\nIn the visualisation 1, click Tooltip under the Marks, select the sheets you want to add.\n\nSelect the sheets wanted:\nFinal look:\nIn the visualisation 2, click Tooltip under the Prop of strongly agree - vac1 section, modify the tooltip according to your needs.\n\nFinal Tooltip:\n4.3 Creating Dashboard\nDrag sheets you want to present into the canvas.\nAdd title and subtitles (using Text object).\n\n\nChange subtitles’ background color.\nAdd filters Gender & Employment Status to the dashboard.\nChnage filters’ form of representation.\nUse Blank to adjust dashboard’s presentation.\nFinal look:\n5. Major Observations\n 1. UK respondents showed the highest willingess to get vaccinated, regardless of female or male. This is consistent with the result of question Vac2.2 with respect to potential side effect. As shown in the relationship chart, UK respondents are also least worried about the side effect of COVID vaccine.\n2. Males are generally more pro-vaccine than Females. 3. Japan’s result is very interesting. Japanese respondents show low willingess in getting vaccine overall, but they also express the highest worries of getting COVID compared to other countries. 38% of Japanese respondents worry about getting COVID whereas less than 38%, 35% of respondents worry about the potential side effects of COVID vaccine, implying getting COVID is more of their concern. 4. The survey results is overall reliable, with a narrow confidence interval for all countries. Netherlands has a relatively larger CI range, but it’s acceptable.\n\n\n\nBy looking into the results of more developed economies in Asia, Japan, Singapore and South korea, we can see that full-time employed respondents are more willing to get vaccination in all three countries, compared to other employment status.\nFrench respondents show the least interest in getting vaccinated, which could possibly be explained by the fear of potential side effect of COVID vaccine as almost half of respondents(44%) strongly worry about the side effect.\n\n\n\n",
    "preview": "posts/2021-02-19-dataviz-makeover-2/distill-preview.png",
    "last_modified": "2021-02-21T10:00:26+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Resident Labour Force by Age Group, comparison between 2009 and 2019.",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [
      "DataViz Makeover"
    ],
    "contents": "\n\nContents\n1. Critiques and Suggestions\n1.1 Clarity\n1.2 Aesthetics\n\n2. Proposed Design\n3. Data Visualisation Step-by-Step\n3.1 Data Preparation\n3.2 Tableau Works\n3.2.1 Import Data\n3.2.2 Visualisation 1\n3.2.3 Visualisation 2\n3.2.4 Visualisation 3\n3.2.5 Visualisation 4\n3.2.6 Dashboard\n\n4. Final Data Visualisation Output\n5. Major Observations\n\nData Visualisation Link (Tableau Public) - https://public.tableau.com/profile/xinyue.bai#!/vizhome/DataVizMakeover1_16118346604830/Dashboard1?publish=yes\n1. Critiques and Suggestions\n\n\n\n1.1 Clarity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n\n\nThere is no y-axis on the graph. Readers can only see the trend of resident labour force percentage by age group. When they want to know the approximate values for certain age groups, they need to look up the table at the bottom, which is not very clear and efficient.\n\n\nAdd y-axis and points for each age group on the graph to facilitate easy reading.\n\n\n\n\nThe purpose of this visualisation is not conveyed well enough by the title. This visualisation aims to compare the share of resident labour force of different age groups between 2009 and 2019. The title “resident labour force by age” is oversimplified.\n\n\nChange the title to “Share of Resident Labour Force by Age Group, 2009 vs 2019 (June)”.\n\n\n\n\nIt’s redundant to have the table at the bottom as it contains the same information as in the line chart. There is no need to have separate representation.\n\n\nMove the table information to the existing line chart, by adding text label for each point.\n\n\n\n\nIn the statement, it mentions the labour force participation rate (LFPR), however in this visualisation, there is no information or visualisation about LFPR.\n\n\nAdd a separate visualisation representing LFPR.\n\n\n\n\nIt’s not clear and easy to see how median age is derived based on this visualisation.\n\n\nAdd a separate visualisation to show how the median age of resident labour force is derived.\n\n\n1.2 Aesthetics\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n\n\nSource and note don’t align, which makes this visualisation look messy at the bottom.\n\n\nSet both source and note to be left or central alignment.\n\n\n\n\nNot efficient use of space, with much white spaces in the top left and right segments. Legend on the line is good, but it’s a bit crowded at the bottom right corner. There are many text components in that area.\n\n\nOptimise use of space.\n\n\n\n\nThe grey and blue line colours are hard to distinguish.\n\n\nChange colour of the two lines.\n\n\n2. Proposed Design\n\n3. Data Visualisation Step-by-Step\n3.1 Data Preparation\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nTable 5 “Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June)” and Table 7 “Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June)” are used for the visualisation.\n\n\n\n\n\n\nFor table 5, only columns Age Group, 2009 and 2019, as well as rows 15-19, 20-24, 25-29, 30-34, 35-30, 40-44, 45-49, 50-54, 55-59, 60-64, 65-69 and 70&over are extracted. Similarly, the same data cleaning procedure was performed for table 7, as for table 5. Below is the final datasets.\n\n\n\n\n\n\nIn order to find the median age of resident labour force, two charts for years 2009 and 2019 were plotted respectively, as shown below. In both years, the 50th percentile falls within age group 40-44. Therefore, a new sheet in table 7 called “Age and year” was created, and the 40-44 age group was split into five values (i.e. 40,41,42,43,44). The same number of resident labour force (i.e. aged 40-44 resident labour force / 5) was assigned to each age.\n\n\n\n\n\n\n\n\n\n\n3.2 Tableau Works\n3.2.1 Import Data\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nImport excel worksheets and create an extract of the data.\n\n\n\n\n\n\nPivot the labour force participation rate data and rename the fields.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3.2.2 Visualisation 1\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag Age Group under T7_T worksheet to Columns.\n\n\n\n\n\n\nDrag Measure Names to Filters and only tick fields of 2009 and 2019.\n\n\n\n\n\n\nSelect Line option in the Marks panel on the left\n\n\n\n\n\n\nDrag Measure Values to Rows and Label, also drag Measure Names to Color.\n\n\n\n\n\n\nIn the Measure Values section, apply Table Calculation (Percentage of Total) to both SUM(2009) and SUM(2019).\n\n\n\n\n\n\nModify the title of y-axis (right click Edit Axis) and the number format of y-axis (right click Format -> Axis -> Numbers -> Percentage).\n\n\n\n\n\n\nChange the name, title and colour of the legend (right click Edit Alias, Edit Title and Edit Colors).\n\n\n\n\n\n\nModify the title of the worksheet.\n\n\n\n\nFinal Look of Visualisation 1\n\n3.2.3 Visualisation 2\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag Age Group and Year under T5_T to Columns.\n\n\n\n\n\n\nDrag LFPR under T5_T to Rows.\n\n\n\n\n\n\nDrag Year to Color.\n\n\n\n\n\n\nDray LFPR to Label.\n\n\n\n\n\n\nHide Year’s header (right click Year -> untick Show Header).\n\n\n\n\n\n\nChange the color of legend.\n\n\n\n\n\n\nModify the title of the worksheet.\n\n\n\n\nFinal Look of Visualisation 2\n\n3.2.4 Visualisation 3\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag 2009 under Age and year to Rows.\n\n\n\n\n\n\nApply Quick Table Calculations (Percent of Total) on 2009.\n\n\n\n\n\n\nDrag Year to Color.\n\n\n\n\n\n\nDrag Age Group under Age and year to Label.\n\n\n\n\n\n\nAdd reference line on the y-axis to point out median age at the 50th percentile (right click on the y-axis -> Add Reference Line -> Value: 0.5, Constant; Label: Custom, Median Age; Line, choose the second option).\n\n\n\n\nFinal Look of Visualisation 3\n\n3.2.5 Visualisation 4\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nPerform the same procedure as for visualisation 3, using data of 2019 under Age and year instead of 2009.\n\n\n\n\n\n\nChange the color of bar.\n\n\n\n\nFinal Look of Visualisation 4\n\n3.2.6 Dashboard\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nCreate a dashboard to combine 4 visualisations and lay out accordingly.\n\n\n\n\n4. Final Data Visualisation Output\n\n5. Major Observations\nThe working population in Singapore is increasing, as for most age groups, labour force participation rate increased from 2009 to 2019. In particular, over 80% of residents aged between 25 and 54 are in the labour force.\nThe composition of resident labour forces in Singapore is changing. In comparison to 2009, share of resident labours aged between 15 and 54 decreased in 2019, whereas for labours aged over 55 years old, their shares in total working population increased in 2019. There are more older labours in the community. This phenomenon can be explained by the economic growth and more accessible health care facilities in Singapore.\nAs we can see from resident labour force’ age group distribution graph, the percentage of older labours increased dramatically from 2009 to 2019. Labours aged over 45 years old was around 40% of working population in 2009, but it’s approaching 50% in 2019. As a result, the median age of residents labours moved from 41 in 2009 to 44 in 2019.\n\n\n\n",
    "preview": "posts/2021-01-28-dataviz-makeover-1/distill-preview.png",
    "last_modified": "2021-03-21T00:54:21+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome",
    "description": "Welcome to my new blog for data visualisation. Hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": "https://www.linkedin.com/in/theabai/"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-21T11:39:42+08:00",
    "input_file": {}
  }
]
