[
  {
    "path": "posts/2021-02-19-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "Dive deeper into survey results of public's willingness on Covid-19 vaccination.",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [
      "DataViz Makeover"
    ],
    "contents": "\n\nContents\n1. Background Information\n2. Critiques and Suggestions\n2.1 Clarity\n2.2 Aesthetics\n\n3. Proposed Design\n3.1 Sketch\n3.2 Advantages of Proposed Design\n\n4. Data Visualisation Step-by-Step\n4.1 Data Preparation\n4.2 Creating Visualisation\n4.2.1 Visualisation 1\n4.2.2 Visualisation 2\n4.2.3 Visualisation 3\n4.2.4 Visualisation 4\n4.2.5 Visualisation 5\n4.2.6 Visualisation 6\n4.2.7 Visualisation 7\nAdd Tooltip on Visualisation 1 & 2\n4.3 Creating Dashboard\n\n5. Major Observations\n\nData Visualisation Link (Tableau Public) - https://public.tableau.com/profile/xinyue.bai#!/vizhome/ofStronglyAgree-gettingCOVID/DatavizMakeover2?publish=yes\n1. Background Information\nFor this visualisation makeover, I have used data from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub. This data gathers global insights on people’s behaviours in response to COVID-19 covering 29 countries, in the form of survey questionnaire. In particular, this post is interested in exploring the willingness of the public on COVID-vaccination. In this blog, I will makeover visualisation on vaccine willingness done by one of the research scientists, by examining the following 3 survey questions in the context of different gender and employment status:\n1. If a Covid-19 vaccine were made available to me this week, I would definitely get it.\n2. I am worried about getting COVID19.\n3. I am worried about potential side effects of a COVID19 vaccine.\n2. Critiques and Suggestions\n\n\n\nFigure 1: original visualisation\n\n\n\n2.1 Clarity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n1\n\n\nVisualisation on the left is intended to show “which country is more pro-vaccine”, by computing the percentage of each response and combining them into a percentage stacked bar chart. However, for each country, it’s not easy to see the proportion of pro-vaccine and compare it among different countries.\n\n\nSort countries by proportion of pro-vaccine responses in descending order.\n\n\n2\n\n\nMoreover, scaling each bar into the same height is not clear enough to compare the difference between pro-vaccine responses and anti-vaccine responses.\n\n\nPlace neutral responses at centre 0, negative value showing proportion of disagree responses and positive value showing proportion of agree responses.\n\n\n3\n\n\nIt’s hard to distinguish bars having the same length.\n\n\nAdd value label on each bar.\n\n\n4\n\n\nLegend is not very clear, i.e. what does 2, 3, 4 represent specifically?\n\n\nChange 2, 3, 4 to 2 – Agree, 3 – I don’t know, 4 – Disagree respectively.\n\n\n5\n\n\nVisualisation on the right is generally straightforward and clear. However, the simple percentage does not reflect statistical measures, how much you can expect your service results to reflect the view from the overall population. For example, if we have a high proportion of strongly agree responses with a wide margin of error, then this survey result is not very reliable.\n\n\nCalculate confidence interval for each value to get a more comprehensive view of the survey results.\n\n\n6\n\n\nMoreover, this visualisation is not convincing enough in a way that only high level view of the survey results is presented and insights from different angles are not revealed. For example, by examining deeper into gender level, males are generally more willing to get vaccinated than females respondents.\n\n\nExplore survey results from various perspectives, such as gender and employment status, and the relation between other survey questions.\n\n\n2.2 Aesthetics\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n1\n\n\nIt’s redundant and distractive to use five different colours for each response in the left visualisation, making it hard to view the survey results. | Use the same colour for the same group (1.agree 2.neutral 3. disagree) with different hue level. For example, dark green for strongly agree, light green for agree.\n\n\nUse the same colour for the same group (1.agree 2.neutral 3. disagree) with different hue level. For example, dark green for strongly agree, light green for agree.\n\n\n2\n\n\nThe x-axis of two visualisations are not consistent, the first plot has no decimal place whereas the second plot has 2 decimal places.\n\n\nMake them consistent.\n\n\n3\n\n\nGenerally good axis marks in twenties and grid lines to facilitate easy readings, clear use of fonts, font sizes and layout with very straightforward titles.\n\n\nFollow and format to ensure so.\n\n\n3. Proposed Design\n3.1 Sketch\nFigure 2: sketch of proposed design3.2 Advantages of Proposed Design\nThe first visualisation:\n1. Clearly show which country is more pro-vaccine, by sorting rows according to % of pro-vaccine.\n2. Easier to detect difference between two types of responses and difference between countries, with postive and negative x-axis representing pro-vaccine and anti-vaccine responses respectively.\nThe second visualisation:\n- Clearly show how reliable the result is, by applying confidence interval.\nThe third visualisation:\n- Help audiences better understand the public willingness on Covid-19 vaccination and the potential reasons why the public agrees or disagrees to getting vaccinated, by looking into the result of survey’s questions vac2.1(worry about getting COVID) and vac2.2(worry about potential side effect of vaccine), and plotting their relation wtih trend lines.\nOther comments:\n- By applying tooltip, the fourth and fifth visualisation provide audiences with a more comprehensive understanding of the survey results on vaccine willingness at the country level. Similarly, being able to filter via gender and employment status gives insights on the different behaviours within each group.\n4. Data Visualisation Step-by-Step\n4.1 Data Preparation\nImport australia.csv, canada.csv, denmark.csv, finland.csv, france.csv, germany.csv, italy.csv, japan.csv, netherlands.csv, norway.csv, singapore.csv, south-korea.csv, sweden.csv, united-kingdom.csv files into tableau.  \nDouble click on New Union at the bottom left of Files and drag all csv files into Specific. \nClick on the triangle button on the top right and custom split variable vac_1 to obtain the score value for each response category (e.g. 1 - Strongly agree -> 1). \nEdit aliases for new column created (i.e. vac_1 - Split 1), 1 -> 1 - Strongly, 2 -> 2 - Agree, 3 -> 3 - I don’t know, 4 -> 4 - Disagree, 5 -> 5 - Strongly disagree. \nRename new column as vac1_score.\nClick on “=Abc” symbol and change its data type to Number(whole). \nRename Table Name as Country.\n4.2 Creating Visualisation\n4.2.1 Visualisation 1\nOpen a new worksheet.\nClick on Analysis -> Create Calculated Field.\nCreate 7 calculated fields as follow:\nNumber of Records - Vac1\nTotal Records - Vac1\nCount Negative\nTotal Count Negative\nPercentage - Vac1\nGantt Start\nGantt Percentage\n\nDrag Country to Rows, Grantt Percentage to Columns, vac1_score to Detail and Color\nGantt Percentage, click on the triangle button -> Compute Using -> vac1_score\nOn the legend panel, right click on Null, exclude null records.\nOn the Marks panel, right click on the triangle button of vac1_score (either color or detail), manually sort the vac1_score, in a order of strongly disagree -> disagree -> I don’t know -> agree -> strongly agree.\n\n\nBefore sort: \nAfter sort: \nChange chart type from Automatic to Gantt Bar\nDrag Percentage - Vac1 to Size and Label.\nAdjust label’s alignment.\nChange label’s format from Automatic to Percentage.\n\n\nSimilarly, right click on the x-axis and choose format, change axis’s value format to Percentage and add tick marks.\n\nAdd tick marks: \nChange color of the gantt bar. What it displays here is already the color I wanted. Red color represents anti-vaccine responses and green color represents pro-vaccine responses. Also, darker color implies more extreme responses (e.g. strongly agree and strongly disagree).\nSort Country by % of pro-vaccine responses.\nRight click on x-axis Edit Axis, change x-axis’s range to -100% to 100% and change its title to % of Total.\n\n\nDrag gender and employment_status to Filters.\n\n\nAdd pro-vaccine and anti-vaccine annotation on the chart for better clarity.\nRight click on the pane and create an annotation box for pro-vaccine.\nRight click on the box and select format to change the background color.  \nApply the same procedure for anti-vaccine annotation. Final look:   \n4.2.2 Visualisation 2\nOpen a new worksheet.\nCreate 11 calculated fields as follow:Number of Strongly Agree - Vac1\nProp of strongly agree - vac1\nZ_95%\nZ_99%\nProp-Standard Error\nProp_Margin of Error 95%\nProp_Margin of Error 99%\nProp_Confidence Interval 95%\nProp_Confidence Interval 99%\n\nDrag Country to Rows and Prop of strongly agree - vac1 to Columns\nDrag Measure Values to the top of x-axis.   \nIn the Filters panel, click on Measure Names -> Edit Filter -> select 95% and 99% upper and lower limits.\n\n\nChange 95% and 99% confidence interval representation to Line, click on the path and choose the last Line Type.\n\n\nDrag Measure Names to path under Measure Values section.\nClick on Measure Names (Detail) under Measure Values section and Prop of strongly agree - vac1 section, change it to Color.\n\nChange columns order, put Measure Values before Prop of strongly agree - vac1 and right click on the top x-axis -> synchronize axis.  \n\n\nChange the Measure Names’ order in the color legend, by adjusting in the Measure Values section.\n\n\nHide the top x-axis, by unticking Show Header.\nSort rows according to % of strongly agree.\nChange the color for 95% and 99% confidence interval according to your own preference, change axis’s number format and add tick marks. Detailed procedures are described in the visualisation 1.\n4.2.3 Visualisation 3\nOpen a new worksheet.\nCreate 8 calculated fields as follow:\nDetailed formulation can refer to visualisation 1, using Vac2.1 and Vac2.2 instead:\nNumber of Records - Vac2.1, Number of Records - Vac2.2\nTotal Records - Vac2.1, Total Records - Vac2.2\n\nDetailed formulation can refer to visualisation 2, using Vac2.1 and Vac2.2 instead.\nNumber of Strongly agree - Vac2.1, Number of Strongly agree - Vac2.2\nProp of strongly agree - vac2.1, Prop of strongly agree - vac2.2\n\nDrag Prop of strongly agree - vac1 to Columns, Prop of strongly agree - vac2.1 and Prop of strongly agree - vac2.2 to Rows, also drag Country to Detail under All section.\nDrag Measure Names to Filters and only tick Prop of strongly agree - vac2.1 and Prop of strongly agree - vac2.2.\nDrag Measure Names to Color under All section.\nRight click on the pane to add two trendlines.\nDrag Country to Label and highlist points wiht minimum % of strongly agree 2.1/2.2 and maximum % of strongly agree 2.1/2.2.\n\nChange axis’s number format and add tick marks. Detailed procedures are described in the visualisation 1.\n4.2.4 Visualisation 4\nOpen a new worksheet.\nDrag Country to Rows and Prop of strongly agree - vac2.1 to Columns, drag another Prop of strongly agree - vac2.1 to the top of x-axis and synchronize axis.\nChange one of the variable representation to Bar.\nAdjust size and color of Bar and Circle.\nDrag Country to Label under Prop of strongly agree - vac2.1 (Circle) section and click on Label to just its Alignment.\nChange the label format to Percentage.\n\nSort rows according to % of strongly agree - vac2.1, change axis’s number format and range, add tick marks. Detailed procedures are described in the visualisation 1.\nFinal look of visualisation 4.   \n4.2.5 Visualisation 5\nSame procedure as visualisation 4, except using Prop of strongly agree - vac2.2 instead of Prop of strongly agree - vac2.1.\n4.2.6 Visualisation 6\nOpen a new worksheet.\nDrag employment_status to Columns, and two vac1_score to Rows, modify both of them to measure Count.\nRight click on the bottom y axis to make the plot into dual axis.\nExclude Null employment status.\nChange one of the vac1_score representation to Line.\nDrag vac1_score to Label under the circle representation and modify it into count.\nApply Quick Table Calculation - Percent of Total to all three CNT(vac1_score).\nKeep only one y-axis, change the name of y-axis. Detailed procedures are described in the previous visualisation.\nFinal look of visualisation 6.\n4.2.7 Visualisation 7\nSame procedure as visualisation 4, except using gender instead of employment_status.\nAdd Tooltip on Visualisation 1 & 2\nIn the visualisation 1, click Tooltip under the Marks, select the sheets you want to add.\n\nSelect the sheets wanted:\nFinal look:\nIn the visualisation 2, click Tooltip under the Prop of strongly agree - vac1 section, modify the tooltip according to your needs.\n\nFinal Tooltip:\n4.3 Creating Dashboard\nDrag sheets you want to present into the canvas.\nAdd title and subtitles (using Text object).\n\n\nChange subtitles’ background color.\nAdd filters Gender & Employment Status to the dashboard.\nChnage filters’ form of representation.\nUse Blank to adjust dashboard’s presentation.\nFinal look:\n5. Major Observations\n 1. UK respondents showed the highest willingess to get vaccinated, regardless of female or male. This is consistent with the result of question Vac2.2 with respect to potential side effect. As shown in the relationship chart, UK respondents are also least worried about the side effect of COVID vaccine.\n2. Males are generally more pro-vaccine than Females. 3. Japan’s result is very interesting. Japanese respondents show low willingess in getting vaccine overall, but they also express the highest worries of getting COVID compared to other countries. 38% of Japanese respondents worry about getting COVID whereas less than 38%, 35% of respondents worry about the potential side effects of COVID vaccine, implying getting COVID is more of their concern. 4. The survey results is overall reliable, with a narrow confidence interval for all countries. Netherlands has a relatively larger CI range, but it’s acceptable.\n\n\n\nBy looking into the results of more developed economies in Asia, Japan, Singapore and South korea, we can see that full-time employed respondents are more willing to get vaccination in all three countries, compared to other employment status.\nFrench respondents show the least interest in getting vaccinated, which could possibly be explained by the fear of potential side effect of COVID vaccine as almost half of respondents(44%) strongly worry about the side effect.\n\n\n\n",
    "preview": "posts/2021-02-19-dataviz-makeover-2/distill-preview.png",
    "last_modified": "2021-02-20T13:02:06+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Resident Labour Force by Age Group, comparison between 2009 and 2019.",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [
      "DataViz Makeover"
    ],
    "contents": "\n\nContents\n1. Critiques and Suggestions\n1.1 Clarity\n1.2 Aesthetics\n\n2. Proposed Design\n3. Data Visualisation Step-by-Step\n3.1 Data Preparation\n3.2 Tableau Works\n3.2.1 Import Data\n3.2.2 Visualisation 1\n3.2.3 Visualisation 2\n3.2.4 Visualisation 3\n3.2.5 Visualisation 4\n3.2.6 Dashboard\n\n4. Final Data Visualisation Output\n5. Major Observations\n\nData Visualisation Link (Tableau Public) - https://public.tableau.com/profile/xinyue.bai#!/vizhome/DataVizMakeover1_16118346604830/Dashboard1?publish=yes\n1. Critiques and Suggestions\n\n\n\n1.1 Clarity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n\n\nThere is no y-axis on the graph. Readers can only see the trend of resident labour force percentage by age group. When they want to know the approximate values for certain age groups, they need to look up the table at the bottom, which is not very clear and efficient.\n\n\nAdd y-axis and points for each age group on the graph to facilitate easy reading.\n\n\n\n\nThe purpose of this visualisation is not conveyed well enough by the title. This visualisation aims to compare the share of resident labour force of different age groups between 2009 and 2019. The title “resident labour force by age” is oversimplified.\n\n\nChange the title to “Share of Resident Labour Force by Age Group, 2009 vs 2019 (June)”.\n\n\n\n\nIt’s redundant to have the table at the bottom as it contains the same information as in the line chart. There is no need to have separate representation.\n\n\nMove the table information to the existing line chart, by adding text label for each point.\n\n\n\n\nIn the statement, it mentions the labour force participation rate (LFPR), however in this visualisation, there is no information or visualisation about LFPR.\n\n\nAdd a separate visualisation representing LFPR.\n\n\n\n\nIt’s not clear and easy to see how median age is derived based on this visualisation.\n\n\nAdd a separate visualisation to show how the median age of resident labour force is derived.\n\n\n1.2 Aesthetics\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n\n\nSource and note don’t align, which makes this visualisation look messy at the bottom.\n\n\nSet both source and note to be left or central alignment.\n\n\n\n\nNot efficient use of space, with much white spaces in the top left and right segments. Legend on the line is good, but it’s a bit crowded at the bottom right corner. There are many text components in that area.\n\n\nOptimise use of space.\n\n\n\n\nThe grey and blue line colours are hard to distinguish.\n\n\nChange colour of the two lines.\n\n\n2. Proposed Design\n\n3. Data Visualisation Step-by-Step\n3.1 Data Preparation\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nTable 5 “Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June)” and Table 7 “Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June)” are used for the visualisation.\n\n\n\n\n\n\nFor table 5, only columns Age Group, 2009 and 2019, as well as rows 15-19, 20-24, 25-29, 30-34, 35-30, 40-44, 45-49, 50-54, 55-59, 60-64, 65-69 and 70&over are extracted. Similarly, the same data cleaning procedure was performed for table 7, as for table 5. Below is the final datasets.\n\n\n\n\n\n\nIn order to find the median age of resident labour force, two charts for years 2009 and 2019 were plotted respectively, as shown below. In both years, the 50th percentile falls within age group 40-44. Therefore, a new sheet in table 7 called “Age and year” was created, and the 40-44 age group was split into five values (i.e. 40,41,42,43,44). The same number of resident labour force (i.e. aged 40-44 resident labour force / 5) was assigned to each age.\n\n\n\n\n\n\n\n\n\n\n3.2 Tableau Works\n3.2.1 Import Data\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nImport excel worksheets and create an extract of the data.\n\n\n\n\n\n\nPivot the labour force participation rate data and rename the fields.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSN\nActions\nScreenshots\n1.\nImport excel worksheets and create an extract of the data.\n\n2.\nPivot the labour force participation rate data and rename the fields.\n\n\n\n\n\n\n\n\n3.2.2 Visualisation 1\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag Age Group under T7_T worksheet to Columns.\n\n\n\n\n\n\nDrag Measure Names to Filters and only tick fields of 2009 and 2019.\n\n\n\n\n\n\nSelect Line option in the Marks panel on the left\n\n\n\n\n\n\nDrag Measure Values to Rows and Label, also drag Measure Names to Color.\n\n\n\n\n\n\nIn the Measure Values section, apply Table Calculation (Percentage of Total) to both SUM(2009) and SUM(2019).\n\n\n\n\n\n\nModify the title of y-axis (right click Edit Axis) and the number format of y-axis (right click Format -> Axis -> Numbers -> Percentage).\n\n\n\n\n\n\nChange the name, title and colour of the legend (right click Edit Alias, Edit Title and Edit Colors).\n\n\n\n\n\n\nModify the title of the worksheet.\n\n\n\n\nFinal Look of Visualisation 1\n\n3.2.3 Visualisation 2\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag Age Group and Year under T5_T to Columns.\n\n\n\n\n\n\nDrag LFPR under T5_T to Rows.\n\n\n\n\n\n\nDrag Year to Color.\n\n\n\n\n\n\nDray LFPR to Label.\n\n\n\n\n\n\nHide Year’s header (right click Year -> untick Show Header).\n\n\n\n\n\n\nChange the color of legend.\n\n\n\n\n\n\nModify the title of the worksheet.\n\n\n\n\nFinal Look of Visualisation 2\n\n3.2.4 Visualisation 3\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag 2009 under Age and year to Rows.\n\n\n\n\n\n\nApply Quick Table Calculations (Percent of Total) on 2009.\n\n\n\n\n\n\nDrag Year to Color.\n\n\n\n\n\n\nDrag Age Group under Age and year to Label.\n\n\n\n\n\n\nAdd reference line on the y-axis to point out median age at the 50th percentile (right click on the y-axis -> Add Reference Line -> Value: 0.5, Constant; Label: Custom, Median Age; Line, choose the second option).\n\n\n\n\nFinal Look of Visualisation 3\n\n3.2.5 Visualisation 4\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nPerform the same procedure as for visualisation 3, using data of 2019 under Age and year instead of 2009.\n\n\n\n\n\n\nChange the color of bar.\n\n\n\n\nFinal Look of Visualisation 4\n\n3.2.6 Dashboard\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nCreate a dashboard to combine 4 visualisations and lay out accordingly.\n\n\n\n\n4. Final Data Visualisation Output\n\n5. Major Observations\nThe working population in Singapore is increasing, as for most age groups, labour force participation rate increased from 2009 to 2019. In particular, over 80% of residents aged between 25 and 54 are in the labour force.\nThe composition of resident labour forces in Singapore is changing. In comparison to 2009, share of resident labours aged between 15 and 54 decreased in 2019, whereas for labours aged over 55 years old, their shares in total working population increased in 2019. There are more older labours in the community. This phenomenon can be explained by the economic growth and more accessible health care facilities in Singapore.\nAs we can see from resident labour force’ age group distribution graph, the percentage of older labours increased dramatically from 2009 to 2019. Labours aged over 45 years old was around 40% of working population in 2009, but it’s approaching 50% in 2019. As a result, the median age of residents labours moved from 41 in 2009 to 44 in 2019.\n\n\n\n",
    "preview": "posts/2021-01-28-dataviz-makeover-1/distill-preview.png",
    "last_modified": "2021-02-20T00:27:11+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome",
    "description": "Welcome to my new blog for data visualisation. Hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": "https://www.linkedin.com/in/theabai/"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-29T12:32:06+08:00",
    "input_file": {}
  }
]
