[
  {
    "path": "posts/2021-01-28-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "Resident Labour Force by Age Group, comparison between 2009 and 2019.",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [
      "DataViz Makeover"
    ],
    "contents": "\n\nContents\n1. Critiques and Suggestions\n1.1 Clarity\n1.2 Aesthetics\n\n2. Proposed Design\n3. Data Visualisation Step-by-Step\n3.1 Data Preparation\n3.2 Tableau Works\n3.2.1 Import Data\n3.2.2 Visualisation 1\n3.2.3 Visualisation 2\n3.2.4 Visualisation 3\n3.2.5 Visualisation 4\n3.2.6 Dashboard\n\n4. Final Data Visualisation Output\n5. Major Observations\n\nData Visualisation Link (Tableau Public) - https://public.tableau.com/profile/xinyue.bai#!/vizhome/DataVizMakeover1_16118346604830/Dashboard1?publish=yes\n1. Critiques and Suggestions\n\n1.1 Clarity\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n\n\nThere is no y-axis on the graph. Readers can only see the trend of resident labour force percentage by age group. When they want to know the approximate values for certain age groups, they need to look up the table at the bottom, which is not very clear and efficient.\n\n\nAdd y-axis and points for each age group on the graph to facilitate easy reading.\n\n\n\n\nThe purpose of this visualisation is not conveyed well enough by the title. This visualisation aims to compare the share of resident labour force of different age groups between 2009 and 2019. The title “resident labour force by age” is oversimplified.\n\n\nChange the title to “Share of Resident Labour Force by Age Group, 2009 vs 2019 (June)”.\n\n\n\n\nIt’s redundant to have the table at the bottom as it contains the same information as in the line chart. There is no need to have separate representation.\n\n\nMove the table information to the existing line chart, by adding text label for each point.\n\n\n\n\nIn the statement, it mentions the labour force participation rate (LFPR), however in this visualisation, there is no information or visualisation about LFPR.\n\n\nAdd a separate visualisation representing LFPR.\n\n\n\n\nIt’s not clear and easy to see how median age is derived based on this visualisation.\n\n\nAdd a separate visualisation to show how the median age of resident labour force is derived.\n\n\n1.2 Aesthetics\n\n\nSN\n\n\nCritique\n\n\nSuggestion\n\n\n\n\nSource and note don’t align, which makes this visualisation look messy at the bottom.\n\n\nSet both source and note to be left or central alignment.\n\n\n\n\nNot efficient use of space, with much white spaces in the top left and right segments. Legend on the line is good, but it’s a bit crowded at the bottom right corner. There are many text components in that area.\n\n\nOptimise use of space.\n\n\n\n\nThe grey and blue line colours are hard to distinguish.\n\n\nChange colour of the two lines.\n\n\n2. Proposed Design\n\n3. Data Visualisation Step-by-Step\n3.1 Data Preparation\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nTable 5 “Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June)” and Table 7 “Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June)” are used for the visualisation.\n\n\n\n\n\n\nFor table 5, only columns Age Group, 2009 and 2019, as well as rows 15-19, 20-24, 25-29, 30-34, 35-30, 40-44, 45-49, 50-54, 55-59, 60-64, 65-69 and 70&over are extracted. Similarly, the same data cleaning procedure was performed for table 7, as for table 5. Below is the final datasets.\n\n\n\n\n\n\nIn order to find the median age of resident labour force, two charts for years 2009 and 2019 were plotted respectively, as shown below. In both years, the 50th percentile falls within age group 40-44. Therefore, a new sheet in table 7 called “Age and year” was created, and the 40-44 age group was split into five values (i.e. 40,41,42,43,44). The same number of resident labour force (i.e. aged 40-44 resident labour force / 5) was assigned to each age.\n\n\n\n\n\n\n\n\n\n\n3.2 Tableau Works\n3.2.1 Import Data\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nImport excel worksheets and create an extract of the data.\n\n\n\n\n\n\nPivot the labour force participation rate data and rename the fields.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSN\nActions\nScreenshots\n1.\nImport excel worksheets and create an extract of the data.\n\n2.\nPivot the labour force participation rate data and rename the fields.\n\n\n\n\n\n\n\n\n3.2.2 Visualisation 1\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag Age Group under T7_T worksheet to Columns.\n\n\n\n\n\n\nDrag Measure Names to Filters and only tick fields of 2009 and 2019.\n\n\n\n\n\n\nSelect Line option in the Marks panel on the left\n\n\n\n\n\n\nDrag Measure Values to Rows and Label, also drag Measure Names to Color.\n\n\n\n\n\n\nIn the Measure Values section, apply Table Calculation (Percentage of Total) to both SUM(2009) and SUM(2019).\n\n\n\n\n\n\nModify the title of y-axis (right click Edit Axis) and the number format of y-axis (right click Format -> Axis -> Numbers -> Percentage).\n\n\n\n\n\n\nChange the name, title and colour of the legend (right click Edit Alias, Edit Title and Edit Colors).\n\n\n\n\n\n\nModify the title of the worksheet.\n\n\n\n\nFinal Look of Visualisation 1\n\n3.2.3 Visualisation 2\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag Age Group and Year under T5_T to Columns.\n\n\n\n\n\n\nDrag LFPR under T5_T to Rows.\n\n\n\n\n\n\nDrag Year to Color.\n\n\n\n\n\n\nDray LFPR to Label.\n\n\n\n\n\n\nHide Year’s header (right click Year -> untick Show Header).\n\n\n\n\n\n\nChange the color of legend.\n\n\n\n\n\n\nModify the title of the worksheet.\n\n\n\n\nFinal Look of Visualisation 2\n\n3.2.4 Visualisation 3\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nDrag 2009 under Age and year to Rows.\n\n\n\n\n\n\nApply Quick Table Calculations (Percent of Total) on 2009.\n\n\n\n\n\n\nDrag Year to Color.\n\n\n\n\n\n\nDrag Age Group under Age and year to Label.\n\n\n\n\n\n\nAdd reference line on the y-axis to point out median age at the 50th percentile (right click on the y-axis -> Add Reference Line -> Value: 0.5, Constant; Label: Custom, Median Age; Line, choose the second option).\n\n\n\n\nFinal Look of Visualisation 3\n\n3.2.5 Visualisation 4\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nPerform the same procedure as for visualisation 3, using data of 2019 under Age and year instead of 2009.\n\n\n\n\n\n\nChange the color of bar.\n\n\n\n\nFinal Look of Visualisation 4\n\n3.2.6 Dashboard\n\n\nSN\n\n\nActions\n\n\nScreenshots\n\n\n\n\nCreate a dashboard to combine 4 visualisations and lay out accordingly.\n\n\n\n\n4. Final Data Visualisation Output\n\n5. Major Observations\nThe working population in Singapore is increasing, as for most age groups, labour force participation rate increased from 2009 to 2019. In particular, over 80% of residents aged between 25 and 54 are in the labour force.\nThe composition of resident labour forces in Singapore is changing. In comparison to 2009, share of resident labours aged between 15 and 54 decreased in 2019, whereas for labours aged over 55 years old, their shares in total working population increased in 2019. There are more older labours in the community. This phenomenon can be explained by the economic growth and more accessible health care facilities in Singapore.\nAs we can see from resident labour force’ age group distribution graph, the percentage of older labours increased dramatically from 2009 to 2019. Labours aged over 45 years old was around 40% of working population in 2009, but it’s approaching 50% in 2019. As a result, the median age of residents labours moved from 41 in 2009 to 44 in 2019.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-29T12:36:41+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome",
    "description": "Welcome to my new blog for data visualisation. Hope you enjoy \nreading what I have to say!",
    "author": [
      {
        "name": "Bai Xinyue",
        "url": "https://www.linkedin.com/in/theabai/"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-01-29T12:32:06+08:00",
    "input_file": {}
  }
]
